app/views/posts/show.html.erb

            <post_by_show>
              <%= first_name %> <%= last_name %> posted on <%= @post.created_at.strftime("%B %d %Y, %l:%M%P") %> · <%= @post.upvotes.count %>
              <% if @post.upvotes.count == 1 %>
---
SELECT COUNT(*) FROM "upvotes" WHERE "upvotes"."post_id" = $1  [["post_id", 1]]